Revit 2027 API
NumberingSchema.NumberingParameterId Property
 The output parameter where the numbering schema generate the final number can now also be set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NumberingParameterId { get; set; }
Public Property NumberingParameterId As ElementId
	Get
	Set
public:
property ElementId^ NumberingParameterId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member NumberingParameterId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given numberingParameterId is valid for this numbering schema.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Values of numbers can be obtained by querying this parameter for the respective numbered element. Note: The parameter can be changed directly, but if a value that already exists in the sequence is provided a warning will be presented asking the user to select a proper course of action. Programmatically with better control the value can be changed(with restrictions) using the ChangeNumber(String, Int32, Int32) method.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace